# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'symfony-cli/tap/symfony-cli'
brew 'stripe/stripe-cli/stripe'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Dev
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'nvm'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'monitorcontrol'
cask 'phpmon'
cask 'phpstorm'
cask 'postman'
cask 'ray'
cask 'raycast'
cask 'session'
cask 'slack'
cask 'sublime-text'
cask 'sublime-merge'
cask 'spectacle'
cask 'telegram'
cask 'transmission'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

# Quicklook
#cask 'qlmarkdown'
#cask 'quicklook-json'